backend/controllers/AuthAssignmentController.php

    protected function findModel($item_name, $user_id)
    {
        if (($model = AuthAssignment::findOne(['item_name' => $item_name, 'user_id' => $user_id])) !== null) {
---
SELECT * FROM `auth_assignment` WHERE (`item_name`='staff') AND (`user_id`='23')