backend/controllers/LoanController.php

SELECT * FROM `loan` WHERE `id`='40'
---
    public function actionIndex()
    {
        $searchModel = new LoanSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);
        $query_Belum_di_approve = \common\models\Loan::find()->where(['start_date'=>"0000-00-00",'due_date'=>Null]);
        $belum_di_Approve = new \yii\data\ActiveDataProvider(
           [
               'query'=>$query_Belum_di_approve,
               'pagination'=>['pageSize'=>10]
           ]
        );
        $time = date("Y-m-d");
        $loan = \common\models\Loan::find()->where(['datediff("'.$time.'",due_date) <' =>'0','return_date'=>Null]);
        $loan_count = \common\models\Loan::find()->where(['datediff("'.$time.'",due_date) <' =>'0','return_date'=>Null]);

SELECT * FROM `loan` WHERE `id`='44'
---
    public function actionApprove($id,$copy_id)
    {
        $member = \common\models\Member::find()->where(['account_id'=>Yii::$app->user->id])->one();
        $time = date("Y-m-d");
        //$times = "2015-12-18";
        $loan_borrower = \common\models\Loan::find()->where(['id'=>$id])->one();

SELECT * FROM `loan` WHERE `id`='15'
SELECT * FROM `book_copy` WHERE `id`='20'
UPDATE `book_copy` SET `availability`=1 WHERE `id`='20'
UPDATE `loan` SET `return_date`='2016-01-22', `fines`=2000 WHERE `id`='15'
---
    public function actionReturn($id,$copy_id)
    {
        $time = date("Y-m-d");
        $loan = new \common\models\Loan();
        $loan_borrower = \common\models\Loan::find()->where(['id'=>$id])->one();
        $loan_borrower->return_date = $time;
        $diff = Yii::$app->db->createCommand('SELECT datediff("'.$time.'",due_date) FROM loan where id = '.$id)->queryScalar();
        if($diff>0){
            $loan_borrower->fines = $diff*200;
        }
        $copybook =  \common\models\BookCopy::find()->where(['id'=>$copy_id])->one();
        $copybook->availability = 1;
        $copybook->save();
        $loan_borrower->save();

SELECT * FROM `loan` WHERE `id`='18'
UPDATE `loan` SET `due_date`='0000-00-00' WHERE `id`='18'
---
    public function actionReject($id)
    {
        $loan = new \common\models\Loan();
        $loan_borrower = \common\models\Loan::find()->where(['id'=>$id])->one();
        $loan_borrower->due_date = '0000-00-00';
        $loan_borrower->save();