backend/views/loan/index.php

                    return ['class'=>'danger'];
                    }
                },
                'columns' => [
                    ['class' => 'yii\grid\SerialColumn'],
                    [
                            'attribute' => 'ID',
                            'format'=>'raw',
                            'value'=>function($model){
                                return Html::a(''.$model->id.'',['view', 'id' => $model->id]);
                            }
                    ],
                    [
                            'attribute' => 'ID',
                            'format'=>'raw',
                            'value'=>function($model){
                                return Html::a(''.$model->copy->book->title.'',['view', 'id' => $model->id]);
                            }
                    ],
                    [
                            'attribute' => 'Borrower',
                            'format'=>'raw',
                            'value'=>function($model){
                                return Html::a(''.$model->borrower->first_name.' '.$model->borrower->last_name.'',['view', 'id' => $model->id]);
                            }
---
SELECT * FROM `book_copy` WHERE `id`='1'
SELECT * FROM `book` WHERE `id`='1'

                    ]); ?>
                                </div>
                <div class="tab-pane" id="settingss">
                    <?= GridView::widget([
                        'dataProvider' => $sudah_jatuh_tempo,
                        //'filterModel' => $searchModel,
                        'columns' => [
                            ['class' => 'yii\grid\SerialColumn'],
                            'id',
                            'copy_id',
                            'borrower.first_name',
                            'staff_id',
                            'start_date',
                            'due_date',
                            'return_date',
                            [
                                'attribute'=>'fines',
                                'format'=>'raw',
                                'value'=> function($model){
                                    return \common\models\Loan::getCount($model->id);
                                }
                            ],
                            [
                                'attribute' => 'Action',
                                'format'=>'raw',
                                'value'=>function($model){
                                    if($model->return_date==NULL){
                                        if($model->start_date=='0000-00-00'){
                                          return Html::a('<button class="btn btn-block btn-success btn-xs">Approve</button>',['approve', 'id' => $model->id,'copy_id'=>$model->copy_id]).Html::a('<button class="btn btn-block btn-danger btn-xs">Reject</button>',['reject', 'id' => $model->id]);
                                        }
                                    else{
                                          return Html::a('<button class="btn btn-block btn-success btn-xs">Return</button>',['return', 'id' => $model->id,'copy_id'=>$model->copy_id]);
                                        }
                                    }
                                    else{
                                          return ' ';
                                    }
                                }
                           ],
                        ],
---
SELECT * FROM `loan` WHERE (datediff("2016-01-22",due_date) <='0') AND (`return_date` IS NULL) LIMIT 10
SELECT COUNT(*) FROM `loan` WHERE (datediff("2016-01-22",due_date) <='0') AND (`return_date` IS NULL)
SELECT COUNT(*) FROM `loan` WHERE (datediff("2016-01-22",due_date) >='0') AND (`return_date` IS NULL)