frontend/controllers/BookController.php

INSERT INTO `loan` (`copy_id`, `borrower_id`) VALUES ('1', '7')
---
    public function actionBorrow($id,$book_id) {

    if(Yii::$app->user->isGuest){
        return $this->redirect(['//site/login']);
    }

    else{
        $loan = new \common\models\Loan();
        $bookcopy = Yii::$app->db->createCommand('select id from book_copy where book_id = '.$book_id)->queryColumn();
        $in = '(';
        for($i=0;$i<sizeof($bookcopy);$i++){
            if($i==(sizeof($bookcopy)-1)){
                $in = $in.$bookcopy[$i].')';
            }
            else
            {
                $in = $in.$bookcopy[$i].',';
            }
        }
        //die($in);
        $member = \common\models\Member::find()->where(['account_id'=>Yii::$app->user->id])->one();
        $user = $member->id;
        $loancount = Yii::$app->db->createCommand('select count(*) from loan where return_date is NULL and borrower_id = '.$user.' and copy_id in '.$in)->queryScalar();
        if($loancount==0){
            //cek untuk uda 3 apa belum yang dipinjam nya
            $loancount_ = Yii::$app->db->createCommand('select count(*) from loan where return_date is NULL and borrower_id = '.$user)->queryScalar();
            if($loancount_<3){
                $loan->copy_id = $id;
                $loan->borrower_id = $user;
                $loan->save();

SELECT * FROM `book` WHERE `id`='1'
SELECT * FROM `author` WHERE `id`='1'
---
    public function actionView($id)
    {
        if(!Yii::$app->user->can('browse')){
            throw new \yii\web\ForbiddenHttpException;
        }
        $bookcopy = new \backend\models\BookCopy();
        $books = Book::find()->where(['id'=>$id])->one();
        $bookCopi = \backend\models\BookCopy::find()->where(['Book_id'=>$books->id]);
        $author = \common\models\Author::findOne(['id'=>$books->author_id]);

SELECT * FROM `book_copy` WHERE `id`='1'
---
     public function actionViewbookcopy($id)
    {
        $bookcopy = \common\models\BookCopy::find()->where(['id'=>$id])->one();

SELECT * FROM `book` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Book::findOne($id)) !== null) {