frontend/controllers/LoanController.php

    public function actionIndex()
    {
        $id = Yii::$app->user->id;
        $member = \common\models\Member::findOne(['account_id'=>$id]);
---
SELECT * FROM `member` WHERE `account_id`='23'