frontend/controllers/MemberController.php

    public function actionViewprofile()
    {
        if(!Yii::$app->user->can('browse')){
            throw new \yii\web\ForbiddenHttpException;
        }
//        $member = $this->findModel(Yii::$app->user->id);
        $member  = \common\models\Member::find()->where(['account_id'=>Yii::$app->user->id])->one();
---
SELECT * FROM `member` WHERE `account_id`='3'

    protected function findModel($id)
    {
        if (($model = Member::findOne($id)) !== null) {
---
SELECT * FROM `member` WHERE `id`='3'