frontend/controllers/SiteController.php

SELECT * FROM `member` WHERE `account_id`='26'
---
    public function actionIndex()
    {
        if(Yii::$app->user->isGuest){
            return $this->redirect(['site/login']);
        }
        $id = Yii::$app->user->id;
        $member = \common\models\Member::find()->where(['account_id'=>$id])->one();