backend/views/layouts/header.php


                <!-- User Account: style can be found in dropdown.less -->
                 <?php $Members = new frontend\models\Member();
                       $member = frontend\models\Member::find()->where(['account_id'=>Yii::$app->user->id])->one();
---
SELECT * FROM `member` WHERE `account_id`='25'