backend/views/book/index.php

                    <?= GridView::widget([
                        'dataProvider' => $dataProvider,
                        'filterModel' => $searchModel,
                        'columns' => [
                            ['class' => 'yii\grid\SerialColumn'],
                            'id',
                            [
                                'attribute' => 'author',
                                'format'=>'raw',
                                'value'=>function($model){
                                    return Html::a(''.$model->author->first_name.'',['author/view', 'id' => $model->author->id]);
                                }
                            ],
                            [
                                'attribute' => 'publisher',
                                'value'=>'publisher.name',
                                'format'=>'raw',
                                'value'=>function($model){
                                    return Html::a(''.$model->publisher->name.'',['publisher/view', 'id' => $model->publisher->id]);
                                }
                            ],
                            'isbn',
                            'title',

                            ['class' => 'yii\grid\ActionColumn'],
---
SELECT * FROM `publisher` WHERE `id`='1'
SELECT * FROM `author` WHERE `id`='1'