backend/views/book/view.php

SELECT * FROM `author` WHERE `id`='1'
---
                        [
                           'attribute'=> 'Author',
                           'fromat'=>'raw',
                           'value'=> $model->author->first_name.' '.$model->author->last_name,