common/models/Account.php

SELECT * FROM `account` WHERE `id`='26'
---
    public static function findIdentity($id) {
        return static::findOne(['id'=>$id]);

SELECT * FROM `account` WHERE `username`='bona123'
---
    public static function findByUsername($username){
        return static::findOne(['username'=>$username]);