backend/views/auth-assignment/_form.php

SELECT * FROM `auth_item` WHERE name like 'guest' or name like 'administrator' or name like 'member' or name like 'staff'
---
<div class="auth-assignment-form">

    <?php $form = ActiveForm::begin(); ?>
    <?=$form->field($model, 'item_name')->dropDownList(\yii\helpers\ArrayHelper::map(\backend\models\AuthItem::find()->where("name like 'administrator' or name like 'member' or name like 'staff' ")->asArray()->all(), 'name', 'name'), ['prompt'=>'-Choose Item Name-']) ?>