frontend/views/book/index.php

                            ['class' => 'yii\grid\SerialColumn'],
                            'id',
                            'isbn',
                            [
                                'attribute' => 'author',
                                'format'=>'raw',
                                'value'=>function($model){
                                    $id = $model->author_id;
                                    $author = backend\models\Author::find()->where(['id'=>$id])->one();
                                    return Html::a(''.$author->first_name.' '.$author->last_name.'',['author/view', 'id' => $author->id]);
                                }
                            ],
---
SELECT * FROM `author` WHERE `id`='1'